* Kendryte K230
#+PLOT: title:"K230 | Varied Network Size, Fan-out 50%, 25% activity"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]" set:"logscale y"
#+PLOT: set:"xlabel 'Network Size (N inputs + N output)'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:1024]"
#+PLOT: labels:("x" "risp" "vrisp" "vrisp-full")
|----------+----------------+----------------+----------------|
| N+N Size |           risp |          vrisp |     vrisp-full |
|----------+----------------+----------------+----------------|
|        / |              < |              < |              < |
|        1 | 3411804.844763 | 2747252.747253 | 3192848.020434 |
|        2 | 1243317.170210 | 2428953.121205 | 2336448.598131 |
|        4 |  818330.605565 | 1539882.968894 | 1510574.018127 |
|        8 |  429387.264374 |  820411.846747 |  941619.585687 |
|       16 |  196216.937446 |  376180.265583 |  498802.873105 |
|       32 |   53958.678444 |  148966.914448 |  251895.513741 |
|       64 |   14084.288835 |   50695.799853 |  113058.224986 |
|      128 |    2041.307490 |   14051.002328 |   32739.654269 |
|      256 |     465.297637 |    3833.576765 |    9597.140820 |
|      512 |      98.518136 |     843.818552 |    1912.665768 |
|     1024 |      21.575642 |     204.586418 |     487.619226 |
|----------+----------------+----------------+----------------|

* Desktop Intel i5-12400F
#+PLOT: title:"Desktop | Varied Network Size, Fan-out 50%, 25% activity"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Network Size (N inputs + N output)'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:*]"
#+PLOT: labels:("x" "risp" "superneuro" "vrisp")
- 64 Input Neurons, 64 Output Neurons, 32 Fan-out, Random Delay 1-N
- 25% Activity, Averaged over 5000 time steps
- Fan-out describes how many output neurons each input is connected to
#+ATTR_HTML: :align center
#+CAPTION: Simulation time steps per second
|----------+-----------------+-----------------+--------------+------------------|
| N+N Size |            risp |           vrisp |   superneuro | vrisp/superneuro |
|----------+-----------------+-----------------+--------------+------------------|
|        / |               < |               < |            < |                < |
|        1 | 28011204.481793 | 28490028.490028 | 46448.544303 |        613.36752 |
|        2 | 13037809.647979 | 20533880.903491 | 46655.282778 |        440.11910 |
|        4 |  8605851.979346 | 11933174.224344 | 44478.247913 |        268.29236 |
|        8 |  2628120.893561 |  6501950.585176 | 29269.377792 |        222.14174 |
|       16 |  1571338.780641 |  2935133.548576 |  5373.868062 |        546.18638 |
|       32 |   502033.234600 |  1486325.802616 |   257.766797 |        5766.1647 |
|       64 |   215127.785905 |   501630.298470 |    18.305242 |        27403.642 |
|      128 |    69391.918617 |   145196.886979 |     1.127357 |        128794.06 |
|      256 |    15340.199607 |    43815.641308 |              |              inf |
|      512 |     3206.732599 |    12882.265114 |              |              inf |
|     1024 |      431.250368 |     3153.772259 |              |              inf |
|----------+-----------------+-----------------+--------------+------------------|
#+TBLFM: $5=($3/$4)
